;Place localized text in this file
[Stormtrooper X2SoldierClassTemplate]
DisplayName="Stormtrooper"
ClassSummary="Charging ever forward, the Stormtrooper relies on their mobility, carrying only a bullpup rifle and a set of grenades. Highly agressive, the Stormtrooper can clear a room easily."

; These entries are used with the "classic" promotion screen that shows just the two ability columns.

LeftAbilityTreeTitle="Clearer"
RightAbilityTreeTitle="Breacher"

; These entries are used for the "new" promotion screen in the Training Center or with the New Promotion Screen By Default mod.

AbilityTreeTitles[0]="Breacher"
AbilityTreeTitles[1]="Runner"
AbilityTreeTitles[2]="Clearer"
AbilityTreeTitles[3]="Xcom"



;ALPHABETICAL ORDER
RandomNickNames[0]="Arbiter"
RandomNickNames[1]="Berserker"
RandomNickNames[2]="Breaker"
RandomNickNames[3]="Bulldog"
RandomNickNames[4]="Cathar"
RandomNickNames[5]="Chance"
RandomNickNames[6]="Charger"
RandomNickNames[7]="Cruiser"
RandomNickNames[8]="Daredevil"
RandomNicknames[9]="Devil Dog"
RandomNickNames[10]="Errant"
RandomNickNames[11]="Final"
RandomNicknames[12]="Fulminatior"
RandomNicknames[13]="Hero"
RandomNickNames[14]="Immortal"
RandomNickNames[15]="Judge"
RandomNickNames[16]="Justicar"
RandomNickNames[17]="Knightmare"
RandomNickNames[18]="Lancer"
RandomNickNames[19]="Motor"
RandomNickNames[20]="Northbound"
RandomNicknames[21]="Overlord"
RandomNicknames[22]="Penetrator"
RandomNickNames[23]="Point Break"
RandomNicknames[24]="Questor"
RandomNickNames[25]="Quickstep"
RandomNicknames[26]="Rider"
RandomNicknames[27]="Stormfront"
RandomNickNames[28]="Templar"
RandomNickNames[29]="Vindicator"
RandomNickNames[30]="Warlord"
RandomNicknames[31]="Zero"

[FindCover X2AbilityTemplate]
LocFriendlyName="Find Cover!"
LocLongDescription="When the first new group of enemies is revealed each turn, gain a bonus action."
LocHelpText="When the first new group of enemies is revealed each turn, gain a bonus action."
LocFlyoverText="Find Cover!"
LocPromotionPopupText="<Bullet/> Find Cover! resets its trigger at the start of Xcom's turn, so if it triggers on Xcom's turn, it will not trigger during the alien's turn.<br/>"